Revit 2026 API

# AdvancedGlazing Class

---

A static class that provides access to the property names that appear in the AdvancedGlazing visual asset schema.

SystemObject Autodesk.Revit.DB.VisualAdvancedGlazing

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class AdvancedGlazing
```
```vb
Public NotInheritable Class AdvancedGlazing
```
```cpp
public ref class AdvancedGlazing abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type AdvancedGlazing = class end
```

The AdvancedGlazing type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GlazingBackfaceCulling | The property labeled "Backface Culling" from the "AdvancedGlazing" schema. |
|  | GlazingF0 | The property labeled "Reflective Color" from the "AdvancedGlazing" schema. |
|  | GlazingTransmissionColor | The property labeled "Transmissive color" from the "AdvancedGlazing" schema. |
|  | GlazingTransmissionRoughness | The property labeled "Transmissive roughness" from the "AdvancedGlazing" schema. |
|  | SurfaceAlbedo | The property labeled "Color" from the "AdvancedGlazing" schema. |
|  | SurfaceAnisotropy | The property labeled "Anisotropy" from the "AdvancedGlazing" schema. |
|  | SurfaceCutout | The property labeled "Image" from the "AdvancedGlazing" schema. |
|  | SurfaceNdfType | The property labeled "NDF" from the "AdvancedGlazing" schema. |
|  | SurfaceNormal | The property labeled "Image" from the "AdvancedGlazing" schema. |
|  | SurfaceRotation | The property labeled "Rotation" from the "AdvancedGlazing" schema. |
|  | SurfaceRoughness | The property labeled "Roughness" from the "AdvancedGlazing" schema. |

#### Reference

Autodesk.Revit.DB.Visual Namespace